СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <basedOn>Document.НаправлениеНаПересдачу</basedOn>
  <registerRecords>AccumulationRegister.НеудачныеПересдачи</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательКомиссии</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НаправлениеНаПересдачу</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначениеСтудентаДляПреподавателя</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВида</name>
      <type>
        <types>EnumRef.НаименованиеВида</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПропусков</name>
      <type>
        <types>EnumRef.КоличествоПропусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотерянныеЧасыПреподавателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НаправлениеНаПересдачу") Тогда
		// Заполнение шапки
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		ПреподавательКомиссии = ДанныеЗаполнения.Преподаватель;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Факультет = ДанныеЗаполнения.Факультет;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
